app/controllers/past_exports_controller.rb

  def index
    @past_exports = PastExport.all.order("created_at DESC")
---
SELECT "past_exports".* FROM "past_exports"  ORDER BY created_at DESC