app/controllers/user_contents_controller.rb

SELECT "user_contents".* FROM "user_contents" WHERE "user_contents"."user_id" = ?  [["user_id", 1]]
---
    def set_user_content
      @user_content = UserContent.find(params[:id])